In [1]:
import numpy as np

In [2]:
import pandas as pd

In [8]:
d={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [9]:
df = pd.DataFrame(d)

In [10]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [13]:
df.dropna() #axis = 0 perfrom on row

     A    B  C
0  1.0  5.0  1

In [14]:
df.dropna(axis=1) #axis = 1 perfrom on column

   C
0  1
1  2
2  3

In [15]:
df.dropna(thresh=1) #atleat value 1 in row

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [16]:
df.dropna(thresh=2) #atleat value 2 in row

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [18]:
df.fillna(value='Rishav')

        A       B  C
0       1       5  1
1       2  Rishav  2
2  Rishav  Rishav  3

In [20]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64